app/views/posts/_form.html.erb

SELECT "users".* FROM "users"
---
  <select name="post[user_id]">
    <% User.all.each do |user| %>