app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
<h2> comments: </h2>
<% @post.comments.each do |comment| %>