app/controllers/comments_controller.rb

  def create
	 	@post = Post.find(params[:post_id])
  	@comment = @post.comments.build(params[:comment])
  	@comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 11]]
INSERT INTO "comments" ("text", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "fdg fdgdfg  dfgdfg  dfgfdfgdf"], ["post_id", 4], ["created_at", "2018-05-17 09:50:45.529558"], ["updated_at", "2018-05-17 09:50:45.529558"]]