app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY "posts"."id" ASC LIMIT 1
---
  def index
    # binding.pry
    @posts = Post.all

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "my first post"], ["text", "lorem ipsum lorem ipsum lorem ipsum lorem ipsum lorem ipsum "], ["created_at", "2018-05-16 07:47:39.032298"], ["updated_at", "2018-05-16 07:47:39.032298"]]
---
  def create
    @post = Post.new(post_params)
    respond_to do |format|
      if @post.save